HmarikBel/ESP32_WiFi_V3.x/src/web_server.cpp
  String s;

  if(false == json) {
    s = F("<html><font size='20'><font color=006666>Open</font><b>EVSE</b></font><p>"
          "<b>Open Source Hardware</b><p>RAPI Command Sent<p>Common Commands:<p>"
          "Set Current - $SC XX<p>Set Service Level - $SL 1 - $SL 2 - $SL A<p>"
          "Get Real-time Current - $GG<p>Get Temperatures - $GP<p>"
          "<p>"
          "<form method='get' action='r'><label><b><i>RAPI Command:</b></i></label>"
          "<input id='rapi' name='rapi' length=32><p><input type='submit'></form>");
  }

  if (request->hasParam("rapi"))
  {
    String rapi = request->getParam("rapi");

    // BUG: Really we should do this in the main loop not here...
    RAPI_PORT.flush();
    int ret = rapiSender.sendCmdSync(rapi);

    if(RAPI_RESPONSE_OK == ret ||
       RAPI_RESPONSE_NK == ret)
    {
      String rapiString = rapiSender.getResponse();

      // Fake $GD if not supported by firmware
      if(RAPI_RESPONSE_OK == ret && rapi.startsWith(F("$ST"))) {
        delayTimer = rapi.substring(4);
      }
      if(RAPI_RESPONSE_NK == ret)
      {
        if(rapi.equals(F("$GD"))) {
          ret = 0;
          rapiString = F("$OK ");
          rapiString += delayTimer;
        }
        else if (rapi.startsWith(F("$FF")))
        {
          DBUGF("Attempting legacy FF support");

          String fallback = F("$S");
          fallback += rapi.substring(4);

          DBUGF("Attempting %s", fallback.c_str());

          int ret = rapiSender.sendCmdSync(fallback.c_str());
          if(RAPI_RESPONSE_OK == ret)
          {
            String rapiString = rapiSender.getResponse();
          }
        }
      }

      if (json) {
        s = "{\"cmd\":\""+rapi+"\",\"ret\":\""+rapiString+"\"}";
      } else {
        s += rapi;
        s += F("<p>&gt;");
        s += rapiString;
      }
    }
    else
    {
      String errorString =
        RAPI_RESPONSE_QUEUE_FULL == ret ? F("RAPI_RESPONSE_QUEUE_FULL") :
        RAPI_RESPONSE_BUFFER_OVERFLOW == ret ? F("RAPI_RESPONSE_BUFFER_OVERFLOW") :
        RAPI_RESPONSE_TIMEOUT == ret ? F("RAPI_RESPONSE_TIMEOUT") :
        RAPI_RESPONSE_OK == ret ? F("RAPI_RESPONSE_OK") :
        RAPI_RESPONSE_NK == ret ? F("RAPI_RESPONSE_NK") :
        RAPI_RESPONSE_INVALID_RESPONSE == ret ? F("RAPI_RESPONSE_INVALID_RESPONSE") :
        RAPI_RESPONSE_CMD_TOO_LONG == ret ? F("RAPI_RESPONSE_CMD_TOO_LONG") :
        RAPI_RESPONSE_BAD_CHECKSUM == ret ? F("RAPI_RESPONSE_BAD_CHECKSUM") :
        RAPI_RESPONSE_BAD_SEQUENCE_ID == ret ? F("RAPI_RESPONSE_BAD_SEQUENCE_ID") :
        RAPI_RESPONSE_ASYNC_EVENT == ret ? F("RAPI_RESPONSE_ASYNC_EVENT") :
        F("UNKNOWN");

      if (json) {
        s = "{\"cmd\":\""+rapi+"\",\"error\":\""+errorString+"\"}";
      } else {
        s += rapi;
        s += F("<p><strong>Error:</strong>");
        s += errorString;
      }

      code = 500;
    }
  }
  if (false == json) {
    s += F("<script type='text/javascript'>document.getElementById('rapi').focus();</script>");
    s += F("<p></html>\r\n\r\n");
  }

  response->setCode(code);
  response->print(s);
  request->send(response);
}

void handleNotFound(MongooseHttpServerRequest *request)
{
  // Not a dynamic handler, check the static resources
  if(web_static_handle(request)) {
    return;
  }

  DBUG("NOT_FOUND: ");
  dumpRequest(request);

  if(net_wifi_mode_is_ap_only()) {
    // Redirect to the home page in AP mode (for the captive portal)
    MongooseHttpServerResponseStream *response = request->beginResponseStream();
    response->setContentType(CONTENT_TYPE_HTML);

    String url = F("http://");
    url += ipaddress;

    String s = F("<html>");
    s += F("<head><meta http-equiv=\"Refresh\" content=\"0; url=");
    s += url;
    s += F("\" /></head><body><a href=\"");
    s += url;
    s += F("\">OpenEVSE</a></body></html>");

    response->setCode(301);
    response->addHeader(F("Location"), url);
    response->print(s);
    request->send(response);
  } else {
    request->send(404);
  }
}

void handleSensors(MongooseHttpServerRequest *request) {

  MongooseHttpServerResponseStream *response;
  if(false == requestPreProcess(request, response, CONTENT_TYPE_JSON)) {
    return;
  }

	char temp[200];
	char uptime[15]; WiFiLogic.formatUptime(uptime);
	char time[20]; WiFiLogic.formatCurrentDateTimeToDisplay(time);
	char lastCorrTime[20]; WiFiLogic.formatDateTimeToDisplay(lastCorrTime, Data.m_lastCorrTime);
	char current[7]; WiFiLogic.sprintf_P_Float(current, Data.m_current.m_currentValue);
	char temperatureIn[7]; WiFiLogic.sprintf_P_Float(temperatureIn, Data.m_temperatureIn.m_currentValue);
	char temperatureInMax[7]; WiFiLogic.sprintf_P_Float(temperatureInMax, Data.m_temperatureInMax);

	sprintf_P(temp, 
		PSTR("{\"t\":%ld,\"e\":%ld,\"p\":%d,\"c\":%s,\"v\":%d,\"tIn\":%s,\"tInMax\":%s,\"uptime\":\"%s\",\"time\":\"%s\",\"lastCorTime\":\"%s\",\"lastCorValue\":\"%d\"}"),
		Data.m_energyTotal, Data.m_energy, Data.m_power.m_currentValue, current, Data.m_voltage.m_currentValue, temperatureIn, temperatureInMax,  
		uptime, time, lastCorrTime, Data.m_lastCorrValue);

	Serial.print(F("Sensors: ")); Serial.println(temp);

  response->setCode(200);
  response->print(temp);
  request->send(response);
}

void handleSarray(MongooseHttpServerRequest *request) {
  MongooseHttpServerResponseStream *response;
  if(false == requestPreProcess(request, response, CONTENT_TYPE_JSON)) {
    return;
  }
	char w[5];

	String str = PSTR("{\"svalues\":[");

	for (int i = 0; i < S_ARRAY_SIZE - 1; i++)
	{
		sprintf_P(w, PSTR("%d"), Data.m_sArray[i]);
		str += w;
		str += ",";
	}

	sprintf_P(w, PSTR("%d"), Data.m_sArray[S_ARRAY_SIZE - 1]);
	str += w;

	str += "]}";

  response->setCode(200);
  response->print(str);
  request->send(response);
}

void handleLog(MongooseHttpServerRequest *request) {
  MongooseHttpServerResponseStream *response;
  if(false == requestPreProcess(request, response, CONTENT_TYPE_JSON)) {
    return;
  }
	char temp[20];
	String res;

	for (int i = 0; i < LOG_SIZE; i++)
	{
		if (Data.m_log[i].m_dateTime == 0)
		{
			continue;
		}

		WiFiLogic.formatDateTimeToDisplay(temp, Data.m_log[i].m_dateTime);

		res += temp;
		res += " ";
		res += Data.m_log[i].m_data;
		res += "\r\n";
	}
  response->setCode(200);
  response->print(res);
  request->send(response);
}

